Feature Engineering - Raw Data -> Meaningful numerical signals through some input

In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv("../data/people_v2.csv")
df

      name   age       city  gender    salary  experience
0     Aman  25.0      Delhi    Male   45000.0           2
1   Bhavna  30.0     Mumbai  Female   80000.0           7
2   Chetan  22.0       Pune    Male   30000.0           1
3    Divya  28.0  Bangalore  Female   60000.0           5
4     Aman  25.0      Delhi    Male   45000.0           2
5     Esha   NaN     Mumbai  Female   70000.0           6
6   Farhan  35.0      Delhi    Male  150000.0          12
7    Gauri  29.0       Pune  Female       NaN           4
8    Harsh  45.0     Mumbai    Male  200000.0          20
9   Ishita  23.0      Delhi  Female   35000.0           1
10   Jatin  38.0  Bangalore    Male  120000.0          15
11   Kiran  26.0       Pune     NaN   40000.0           3

FILLING MISSING VALUES

In [9]:
df["age"] = df["age"].fillna(df["age"].median())
df["salary"] = df["salary"].fillna(df["salary"].median())

In [10]:
df["gender"] = df["gender"].fillna(df["gender"].mode()[0])

In [11]:
df

      name   age       city  gender    salary  experience
0     Aman  25.0      Delhi    Male   45000.0           2
1   Bhavna  30.0     Mumbai  Female   80000.0           7
2   Chetan  22.0       Pune    Male   30000.0           1
3    Divya  28.0  Bangalore  Female   60000.0           5
4     Aman  25.0      Delhi    Male   45000.0           2
5     Esha  28.0     Mumbai  Female   70000.0           6
6   Farhan  35.0      Delhi    Male  150000.0          12
7    Gauri  29.0       Pune  Female   60000.0           4
8    Harsh  45.0     Mumbai    Male  200000.0          20
9   Ishita  23.0      Delhi  Female   35000.0           1
10   Jatin  38.0  Bangalore    Male  120000.0          15
11   Kiran  26.0       Pune    Male   40000.0           3

SEPARATING TYPES

In [12]:
categorical_cols = ["city", "gender"]
numerical_cols = ["age", "salary", "experience"]

In [17]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df['gender_encoded']=le.fit_transform(df["gender"])

In [18]:
df_encoded = pd.get_dummies(df,columns=categorical_cols, drop_first=True)
df_encoded

,name,age,salary,experience,gender_encoded,city_Delhi,city_Mumbai,city_Pune,gender_Male
0,Aman,25.0,45000.0,2,1,True,False,False,True
1,Bhavna,30.0,80000.0,7,0,False,True,False,False
2,Chetan,22.0,30000.0,1,1,False,False,True,True
3,Divya,28.0,60000.0,5,0,False,False,False,False
4,Aman,25.0,45000.0,2,1,True,False,False,True
5,Esha,28.0,70000.0,6,0,False,True,False,False
6,Farhan,35.0,150000.0,12,1,True,False,False,True
7,Gauri,29.0,60000.0,4,0,False,False,True,False
8,Harsh,45.0,200000.0,20,1,False,True,False,True
9,Ishita,23.0,35000.0,1,0,True,False,False,False
10,Jatin,38.0,120000.0,15,1,False,False,False,True
11,Kiran,26.0,40000.0,3,1,False,False,True,True

In [20]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
df_encoded[numerical_cols] = scaler.fit_transform(df_encoded[numerical_cols])

In [19]:
df['salary_log']=np.log1p(df['salary'])

In [22]:
df_model = df_encoded.drop(columns=["name"])

In [23]:
df_model.dtypes

age               float64
salary            float64
experience        float64
gender_encoded      int64
city_Delhi           bool
city_Mumbai          bool
city_Pune            bool
gender_Male          bool
dtype: object

In [25]:
X = df_encoded.drop(columns=["salary"])
y = df_encoded["salary"]